# Lab 04 - Pandas II

Name: Jimmy Pronchick  
Class: CSCI349 2023SP - Intro to Data Mining  
Instructor: Brian King

In [138]:
import sys
import numpy as np
import pandas as pd

In [139]:
sys.version

'3.9.16 (main, Jan 11 2023, 16:16:36) [MSC v.1916 64 bit (AMD64)]'

In [140]:
np.__version__

'1.23.5'

In [141]:
pd.__version__

'1.5.2'

In [142]:
days = ["Mon","Tues","Wed","Thu","Fri","Student"]

In [219]:
scores = pd.DataFrame([pd.Series([8.75, 9.5, 8, 10, 7.75, "Bob"], index=days, name="week_1"),pd.Series([8, 9, 10, 8.75, 7.25, "Jane"], index=days, name="week_1"),pd.Series([0, 8, 9.75, 9, 6, "Bob"], index=days, name="week_2"),pd.Series([8.25, 7, 0, 9.25, 8, "Jane"], index=days, name="week_2"),pd.Series([8.5, 7, 9.25, 0, 0, "Bob"], index=days, name="week_3"),pd.Series([8.25, 8.25, 0, 8,7.5, "Jane"], index=days, name="week_3"),pd.Series([6.5, 8.75, 8.5, 8, 6, "Bob"], index=days, name="week_4"),pd.Series([10, 9.25, 8.5, 7.75, 7.5, "Jane"], index=days, name="week_4"),])
#missing scores are noted with a 0
scores

          Mon  Tues    Wed    Thu   Fri Student
week_1   8.75  9.50   8.00  10.00  7.75     Bob
week_1   8.00  9.00  10.00   8.75  7.25    Jane
week_2   0.00  8.00   9.75   9.00  6.00     Bob
week_2   8.25  7.00   0.00   9.25  8.00    Jane
week_3   8.50  7.00   9.25   0.00  0.00     Bob
week_3   8.25  8.25   0.00   8.00  7.50    Jane
week_4   6.50  8.75   8.50   8.00  6.00     Bob
week_4  10.00  9.25   8.50   7.75  7.50    Jane

1)[P]Report the shape, the number of dimensions, the size of the data, and the data types of each column. Print each separately. Then create an additional code cell that shows the results of scores.info().Comment on what the info()method does on data frames.

In [144]:
scores.shape

(8, 6)

In [145]:
scores.size

48

In [146]:
scores.dtypes

Mon        float64
Tues       float64
Wed        float64
Thu        float64
Fri        float64
Student     object
dtype: object

In [147]:
#dataframe.info() prints out the indexing of the columns, the data types of the cols, col names, memory usage, range
scores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, week_1 to week_4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Mon      8 non-null      float64
 1   Tues     8 non-null      float64
 2   Wed      8 non-null      float64
 3   Thu      8 non-null      float64
 4   Fri      8 non-null      float64
 5   Student  8 non-null      object
dtypes: float64(5), object(1)
memory usage: 448.0+ bytes

2)[P] Show two different ways to report the number of observations in scores.

In [148]:
len(scores)

8

In [149]:
scores.count()

Mon        8
Tues       8
Wed        8
Thu        8
Fri        8
Student    8
dtype: int64

3)[P] Show the variables (i.e. columns) in scores

In [150]:
scores.columns

Index(['Mon', 'Tues', 'Wed', 'Thu', 'Fri', 'Student'], dtype='object')

4)[P] There are repetitive names in the index. This happens quite a bit, depending on how thedata is organized. For now. printthe uniqueindex namesin scores

In [151]:
scores.index.unique()

Index(['week_1', 'week_2', 'week_3', 'week_4'], dtype='object')

5)[P] Rename the 'Tues'column header to be 'Tue'. (Hint: Changing scores.columns[1]directly will not work, not to mention it would be a poor approach to hard code a location this way!Magic numbers arenever a good idea when referencing index or column locations.They may change!) Show the new scoresdata frame. This should be the same, except with Tueschanged to Tue.

In [152]:
scores=scores.rename(columns={"Tues":"Tue"})
scores

          Mon   Tue    Wed    Thu   Fri Student
week_1   8.75  9.50   8.00  10.00  7.75     Bob
week_1   8.00  9.00  10.00   8.75  7.25    Jane
week_2   0.00  8.00   9.75   9.00  6.00     Bob
week_2   8.25  7.00   0.00   9.25  8.00    Jane
week_3   8.50  7.00   9.25   0.00  0.00     Bob
week_3   8.25  8.25   0.00   8.00  7.50    Jane
week_4   6.50  8.75   8.50   8.00  6.00     Bob
week_4  10.00  9.25   8.50   7.75  7.50    Jane

6)[P] Now, make a bigger change. Let'srename 'week_1'to be 'w1', 'week_2'to be 'w2', and so on. Also, suppose you decide to useonly 2 letter abbreviations for the days. Rename thedays in thecolumn namesto be 'Mo', 'Tu', 'We', 'Th', 'Fr'.Show the updated scoresdataframe. It should appearas follows:

In [153]:
scores.rename(columns=(lambda x: x[0:2]),index=lambda x: x[::5], inplace=True)
scores

       Mo    Tu     We     Th    Fr    St
w1   8.75  9.50   8.00  10.00  7.75   Bob
w1   8.00  9.00  10.00   8.75  7.25  Jane
w2   0.00  8.00   9.75   9.00  6.00   Bob
w2   8.25  7.00   0.00   9.25  8.00  Jane
w3   8.50  7.00   9.25   0.00  0.00   Bob
w3   8.25  8.25   0.00   8.00  7.50  Jane
w4   6.50  8.75   8.50   8.00  6.00   Bob
w4  10.00  9.25   8.50   7.75  7.50  Jane

7)[PM] Compare the typeof the expression scores['Mo'] vs. scores[['Mo']]. What is the difference? (HINT: use the type()Python function on both.)

In [154]:
type(scores['Mo'])

pandas.core.series.Series

In [155]:
type(scores[['Mo']])

pandas.core.frame.DataFrame

['Mo'] selects just the column for the attr 'Mo', which is a one dimensional series. [['Mo']] selects the container around the column ['Mo'], the dataframe.

In [156]:
# Read about the describe()method of data frames. (FYI -This is essentially the equivalent to the summary()function in R.)

8)[P] Demonstrate the describe()method onscores. What type does it return?

In [157]:
scores.describe()

              Mo        Tu         We         Th        Fr
count   8.000000  8.000000   8.000000   8.000000  8.000000
mean    7.281250  8.343750   6.750000   7.593750  6.250000
std     3.095035  0.963045   4.219428   3.159276  2.635608
min     0.000000  7.000000   0.000000   0.000000  0.000000
25%     7.625000  7.750000   6.000000   7.937500  6.000000
50%     8.250000  8.500000   8.500000   8.375000  7.375000
75%     8.562500  9.062500   9.375000   9.062500  7.562500
max    10.000000  9.500000  10.000000  10.000000  8.000000

9)[P] Storethe output of describe()as a variable. Then, using this data frame,report the day that had the largest standard deviation in quiz scores and its value.Clean your temporary variables when complete (i.e. use del)

In [179]:
stats = scores.describe()
maxS = (stats.loc['std'].max())
day = stats.loc['std'].idxmax()
print('{} had the largest standard deviation: {:.3f}'.format(day,maxS))

We had the largest standard deviation: 4.219

In [180]:
del stats
del maxS
del day

10)[P] Knowing that describe()is nothing more than another data frame is interesting. However, it's moreimportantto write code to output the specific results you are looking for. Write the Python code to repeat the previous exercise withoutusing describe().

In [213]:
stats=pd.DataFrame({'count':scores.count(numeric_only=True),'mean':scores.mean(numeric_only=True),
                    'std':scores.std(numeric_only=True), 'min':scores.min(numeric_only=True),
                    '25%':scores.quantile(.25,numeric_only=True),'50%':scores.quantile(.5,numeric_only=True),
                     '75%':scores.quantile(.75,numeric_only=True),'max':scores.max(numeric_only=True)})
stats.T

              Mo        Tu         We         Th        Fr
count   8.000000  8.000000   8.000000   8.000000  8.000000
mean    7.281250  8.343750   6.750000   7.593750  6.250000
std     3.095035  0.963045   4.219428   3.159276  2.635608
min     0.000000  7.000000   0.000000   0.000000  0.000000
25%     7.625000  7.750000   6.000000   7.937500  6.000000
50%     8.250000  8.500000   8.500000   8.375000  7.375000
75%     8.562500  9.062500   9.375000   9.062500  7.562500
max    10.000000  9.500000  10.000000  10.000000  8.000000

11)[P] Write the code that changes all 0.0entries to np.nan.  (NOTE: You should be able to do this with just one line of code using pandasselection techniques!) Then, show scores. All 0.0 entries should be replaced with NaNin the output.

In [220]:
scores.where(scores!=0, other=np.nan, inplace=True)
scores

          Mon  Tues    Wed    Thu   Fri Student
week_1   8.75  9.50   8.00  10.00  7.75     Bob
week_1   8.00  9.00  10.00   8.75  7.25    Jane
week_2    NaN  8.00   9.75   9.00  6.00     Bob
week_2   8.25  7.00    NaN   9.25  8.00    Jane
week_3   8.50  7.00   9.25    NaN   NaN     Bob
week_3   8.25  8.25    NaN   8.00  7.50    Jane
week_4   6.50  8.75   8.50   8.00  6.00     Bob
week_4  10.00  9.25   8.50   7.75  7.50    Jane

12)[P]Show the output of describe()again. You should notice much more reasonable SD values.Note how much more informative this output is when properly dealing with missing data. Then, copyyour code from above to output the day with the largest standard deviation in quiz scores.You should have a substantially different result than you did before.

In [221]:
scores.describe()

             Mon      Tues        Wed        Thu       Fri
count   7.000000  8.000000   6.000000   7.000000  7.000000
mean    8.321429  8.343750   9.000000   8.678571  7.142857
std     1.037970  0.963045   0.790569   0.812843  0.814672
min     6.500000  7.000000   8.000000   7.750000  6.000000
25%     8.125000  7.750000   8.500000   8.000000  6.625000
50%     8.250000  8.500000   8.875000   8.750000  7.500000
75%     8.625000  9.062500   9.625000   9.125000  7.625000
max    10.000000  9.500000  10.000000  10.000000  8.000000

In [222]:
stats = scores.describe()
maxS = (stats.loc['std'].max())
day = stats.loc['std'].idxmax()
print('{} had the largest standard deviation: {:.3f}'.format(day,maxS))

Mon had the largest standard deviation: 1.038

13)[PM] Show the output of scores.values. What does the .valuesattribute do?

In [225]:
scores.values

array([[8.75, 9.5, 8.0, 10.0, 7.75, 'Bob'],
       [8.0, 9.0, 10.0, 8.75, 7.25, 'Jane'],
       [nan, 8.0, 9.75, 9.0, 6.0, 'Bob'],
       [8.25, 7.0, nan, 9.25, 8.0, 'Jane'],
       [8.5, 7.0, 9.25, nan, nan, 'Bob'],
       [8.25, 8.25, nan, 8.0, 7.5, 'Jane'],
       [6.5, 8.75, 8.5, 8.0, 6.0, 'Bob'],
       [10.0, 9.25, 8.5, 7.75, 7.5, 'Jane']], dtype=object)

dataframe.values returns the dataframe as an ndarray.

14)[P] What is the mean quiz score for each day? Do not use describe()

In [230]:
scores.mean(numeric_only=True)

Mon     8.321429
Tues    8.343750
Wed     9.000000
Thu     8.678571
Fri     7.142857
dtype: float64

15)[P] What is the mean quiz score over the entiredataset, ignoringall missing values?

In [260]:
(scores.sum(numeric_only=True, skipna=True).sum()) / scores.count(numeric_only=True).sum()

8.278571428571428

16)[P] Showthe mean for each week over all students. Again, you are not counting missing quizzes into the average. (Yes, technically you could write a loop to compute this exhaustively. However, you should rarely need to do that. Use pandas!)

In [306]:
scores.mean(1,numeric_only=True).groupby(scores.index.unique())
# scores.groupby(scores.index.unique()).mean()
# scores.index.unique()

ValueError: Grouper and axis must be same length

17)[P] Show the mean score for each student. Again, ignore all missing values.

In [283]:
scores.mean(1,numeric_only=True)

week_1    8.8000
week_1    8.6000
week_2    8.1875
week_2    8.1250
week_3    8.2500
week_3    8.0000
week_4    7.5500
week_4    8.6000
dtype: float64